/**
 * Format:
 * {dataType}
 * [optional entry]
 *
 * Question:
 *    description {string} - Опис ситуації, вступ до запитання
 *    question {string} - Текст запитання
 *    [image] {string} - Шлях до файлу зображення для ситуації
 *    options {Option[]} - Варіанти відповідей
 *    results {Result[]} - Результати відповідей
 *
 * Option:
 *    image {string} - Шлях до файлу зображення для варіанту відповіді
 *    [description] {string} - Підпис варіанту відповіді
 *
 * Result:
 *    description {string} - Опис результату відповіді
 *    status {string} "green" | "yellow" | "red" - Статус результату відповіді
 */

export const questions = [
  {
    description: "Ти прокидаєшся і йдеш у ванну, щоб почистити зуби.",
    question: "Як ти це робитимеш?",
    image: "question-image.png",
    options: [
      {
        image: "option-image.png"
      },
      {
        image: "option-image.png"
      }
    ],
    results: [
      {
        description: "До тебе в квартиру увірвались десяток озброєних людей. Тебе безцеремонно вбили, адже вмикати воду під час чистки зубів - це елементарне екологічне правило, яке повинен знати і дотримуватись кожен",
        status: "red"
      },
      {
        description: "Так тримати. Вимикати воду під час чистки зубів - це гарний спосіб асимілюватись у новому світі, адже тут активно боряться з дефіцитом води",
        status: "green"
      }
    ]
  },
  {
    description: "Після вмивання ти хочеш поснідати, але у холодильнику порожньо. Потрібно сходити у магазин",
    question: "Як туди будеш добиратись?",
    image: "question-image.png",
    options: [
      {
        image: "option-image.png"
      },
      {
        image: "option-image.png"
      },
      {
        image: "option-image.png"
      },
      {
        image: "option-image.png"
      }
    ],
    results: [
      {
        description: "Ти круто влився у цей світ. Ще й каву у своє горнятко попросив налити :) Ти точно з іншого виміру?",
        status: "green"
      },
      {
        description: "Ну таке... викликаєш підозри. Можна було б пішки пройтись. Корисніше для здоровʼя",
        status: "yellow"
      },
      {
        description: "Ти реально поїхав в магаз на машині? Зараз всі магазини в пішій доступності. Земля тобі пухом",
        status: "red"
      },
      {
        description: "Ти дуже кмітливий. Так тримати",
        status: "green"
      },
    ]
  },
  {
    description: "Ти у магазині.",
    question: "Продуктам з яким маркуванням ти будеш надавати перевагу?",
    options: [
      {
        image: "option-image.png"
      },
      {
        image: "option-image.png"
      },
      {
        image: "option-image.png"
      },
      {
        image: "option-image.png"
      }
    ],
    results: [
      {
        description: "Ecolabel - знак екомаркування ЄС, якому вже 30 років, що сертифікує продукти з гарантованим, незалежно перевіреним низьким впливом на навколишнє середовище по ISO 14024.",
        status: "green"
      },
      {
        description: "Це український знак екологічного продукту \"Зелений журавлик\", визнаний Глобальною мережею екологічного маркування (GEN).",
        status: "green"
      },
      {
        description: "Це маркування не є офіційним та не визнано міжнародними стандартами. Це, так званий, звичайний грінвошинг. Краще тобі тікати, бо за тобою вже виїхали.",
        status: "red"
      },
      {
        description: "І це також приклад грінвошингу. Бренди розраховують на вашу неуважність і довірливість. Знак листочка, дерева або планети ніяк не можуть гарантувати екологічність товару, тому що не є офіційними.",
        status: "red"
      }
    ]
  },
  {
    description: "У магазині ти купив необхідні продукти.",
    question: "У що будеш їх класти?",
    options: [
      {
        image: "option-image.png"
      },
      {
        image: "option-image.png"
      },
      {
        image: "option-image.png"
      },
      {
        image: "option-image.png"
      }
    ],
    results: [
      {
        description: "Ти вмер. Ноу коментс",
        status: "red"
      },
      {
        description: "Молодець! Ти обрав дуже круте та стильне рішення",
        status: "green"
      },
      {
        description: "Гарний вибір. Тебе ніхто не запідозрив",
        status: "green"
      },
      {
        description: "Охорона трішки косилась на тебе. паперові пакети можна купувати якщо забув шопер. В іншому випадку - це дурна трата ресурсу, адже їх вистачає на 1-3 рази",
        status: "yellow"
      }
    ]
  },
  {
    description: "Після походу у магазин ти приготував собі на сніданок салат та смачно поїв. Але в тебе залишились половинки деяких овочів.",
    question: "Як ти складеш їх у холодильник?",
    image: "question-image.png",
    options: [
      {
        image: "option-image.png"
      },
      {
        image: "option-image.png"
      },
      {
        image: "option-image.png"
      },
      {
        image: "option-image.png",
        description: "покладу так/не загортатиму"
      }
    ],
    results: [
      {
        description: "Вау, ти дуже обізнаний, якщо використовуєш вощанки! Аплодуємо стоячи!",
        status: "green"
      },
      {
        description: "Ну як ти міг так попастися? Харчова плівка, серйозно?",
        status: "red"
      },
      {
        description: "Хороший варіант, якщо контейнери скляні. Проте в такому випадку дуже важоиво дбати про подальшу переробку кришок та скляної тари",
        status: "green"
      },
      {
        description: "Неправильна відповідь. Якщо вже порізали/почистили продукт, то важоиво подбати про його зберігання. Нічим не накритий продукт швидко псується. Ще одна даремна витрата ресурсів",
        status: "red"
      }
    ]
  }
];
